Web_turestaurant/app/controllers/platos_controller.rb

  def index
    @platos = Plato.all
---
SELECT "platos".* FROM "platos"

  def create
    @plato = Plato.new(plato_params)

    respond_to do |format|
      if @plato.save
---
INSERT INTO "platos" ("nombre_plato", "precio_plato", "categoria_plato", "descripcion_plato", "cantidad_porciones", "created_at", "updated_at", "sede_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_plato
      @plato = Plato.find(params[:id])
---
SELECT  "platos".* FROM "platos" WHERE "platos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]