Web_turestaurant/app/controllers/restaurants_controller.rb

	def index
		@restaurants = Restaurant.all.order('created_at DESC')
---
SELECT "restaurants".* FROM "restaurants" ORDER BY created_at DESC

	def create
		@restaurant = Restaurant.new(restaurant_params)

		respond_to do |format|
	      if @restaurant.save
---
INSERT INTO "restaurants" ("razon_social", "ruc", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["razon_social", "Norkys SA"], ["ruc", 88833190310931], ["categoria", "Polleria"], ["created_at", "2018-03-31 23:53:29.664786"], ["updated_at", "2018-03-31 23:53:29.664786"]]

	def update
		@restaurant = Restaurant.find(params[:id])

		respond_to do |format|
	      if @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "restaurants" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["avatar_file_name", "ActivityDiagram1.jpg"], ["avatar_file_size", 83101], ["avatar_updated_at", "2018-05-06 17:32:25.075463"], ["updated_at", "2018-05-06 17:32:25.355498"], ["id", 16]]