Web_turestaurant/app/controllers/sedes_controller.rb

	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		@sede = @restaurant.sedes.create(params[:sede].permit(:direccion, :cantidad_de_mesas, :latitud, :longitud))
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sedes" ("name", "body", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sede 1"], ["body", "hola"], ["restaurant_id", 1], ["created_at", "2018-03-31 23:23:24.551290"], ["updated_at", "2018-03-31 23:23:24.551290"]]

	def destroy
		@restaurant = Restaurant.find(params[:restaurant_id])
		@sede = @restaurant.sedes.find(params[:id])
		@sede.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sedes".* FROM "sedes" WHERE "sedes"."restaurant_id" = ? AND "sedes"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "sedes" WHERE "sedes"."id" = ?  [["id", 1]]