Web_turestaurant/app/controllers/api/v1/platos_controller.rb

    def index
        sede = Sede.find(params[:sede_id])
		plato = sede.platos.order("created_at DESC")
---
SELECT  "sedes".* FROM "sedes" WHERE "sedes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."sede_id" = ? ORDER BY created_at DESC  [["sede_id", 1]]