Web_turestaurant/app/controllers/api/v1/restaurants_controller.rb

    def index
        restaurants = Restaurant.order("created_at DESC")
---
SELECT "restaurants".* FROM "restaurants" ORDER BY created_at_DESC

    def show
        restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        restaurant = Restaurant.new(restaurant_params)

        if Restaurant.exists?(id: restaurant.id)
            if restaurant.save
---
INSERT INTO "restaurants" ("razon_social", "ruc", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["razon_social", "Papa Johns33"], ["ruc", 231231266312], ["categoria", "Pizzeria"], ["created_at", "2018-04-05 06:25:45.858446"], ["updated_at", "2018-04-05 06:25:45.858446"]]