Web_turestaurant/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
    def index
        users = User.order("created_at DESC")