app/controllers/api/v1/sedes_controller.rb

    def index
        restaurant = Restaurant.find(params[:restaurant_id])
		sede = restaurant.sedes.order("created_at DESC")
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sedes".* FROM "sedes" WHERE "sedes"."restaurant_id" = ? ORDER BY created_at DESC  [["restaurant_id", 1]]

    def show
        restaurant = Restaurant.find(params[:restaurant_id])
        sede = restaurant.sedes.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sedes".* FROM "sedes" WHERE "sedes"."restaurant_id" = ? AND "sedes"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]