app/views/restaurants/show.html.erb

SELECT "sedes".* FROM "sedes" WHERE "sedes"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "sedes" WHERE "sedes"."restaurant_id" = ?  [["restaurant_id", 1]]
---
	<div id="comments">
		<h2><%= @restaurant.sedes.count %> Sedes</h2>