Web_turestaurant/app/views/platos/_form.html.erb

    <%= form.label :restaurant_id %>
  	<%= form.collection_select :restaurant_id, Restaurant.order(:id),:id,:razon_social %>
---
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."id" ASC

    <%= form.label :sede_id %>
  	<%= form.grouped_collection_select :sede_id, Restaurant.order(:id),:sedes,:razon_social,:id,:direccion %>
---
SELECT "sedes".* FROM "sedes" WHERE "sedes"."restaurant_id" = ?  [["restaurant_id", 1]]