Web_turestaurant/app/views/platos/index.html.erb

      <tr>
        <td><%= Restaurant.find(Sede.find(plato.sede_id).restaurant_id).razon_social %></td>
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "sedes".* FROM "sedes" WHERE "sedes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]