app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" ORDER BY created_at DESC
---
	def index
		@restaurants = Restaurant.all.order('created_at DESC')

INSERT INTO "restaurants" ("razon_social", "ruc", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["razon_social", "Norkys SA"], ["ruc", 88833190310931], ["categoria", "Polleria"], ["created_at", "2018-03-31 23:53:29.664786"], ["updated_at", "2018-03-31 23:53:29.664786"]]
---
	def create
		@restaurant = Restaurant.new(restaurant_params)

		if @restaurant.save